# Основание меньше 36

import string

alf = '0123456789' + string.ascii_uppercase

for x in alf[:22]:
    a = int('12313' + x + '57', 22) # f'12313{x}57'
    b = int('1' + x + '34561', 22) # f'1{x}34561'
    c = a + b
    if c % 21 == 0:
        print(x, c // 21)


# Основание больше 36

for x in range(40):
    a = 8 * 40 ** 6 + 7 * 40 ** 5 + 1 * 40 ** 4 + x * 40 ** 3 + 2 * 40 ** 2 + 9 * 40 + 1
    b = 3 * 40 ** 6 + 6 * 40 ** 5 + 6 * 40 ** 4 + x * 40 ** 3 + 6 * 40 ** 2 + 3 * 40 + 1
    c = 9 * 40 ** 6 + 7 * 40 ** 5 + 3 * 40 ** 4 + x * 40 ** 3 + 6 * 40 ** 2 + 1 * 40 + 8
    c = a + b + c
    if c % 39 == 0:
        print(x, c // 13)


